{"config": [{"class_name": "Convolution2D", "config": {"nb_filter": 8, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 22, 64, 3], "dim_ordering": "tf", "name": "convolution2d_1", "border_mode": "valid", "subsample": [1, 1], "init": "glorot_uniform", "input_dtype": "float32", "W_constraint": null, "trainable": true, "bias": true, "nb_row": 2, "b_regularizer": null, "nb_col": 2, "activation": "linear"}}, {"class_name": "AveragePooling2D", "config": {"dim_ordering": "tf", "trainable": true, "name": "averagepooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.25}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_1", "axis": -1, "momentum": 0.99}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_filter": 16, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "convolution2d_2", "subsample": [1, 1], "border_mode": "valid", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "nb_row": 2, "bias": true, "trainable": true, "b_regularizer": null, "nb_col": 2, "dim_ordering": "tf"}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_2", "axis": -1, "momentum": 0.99}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "convolution2d_3", "subsample": [1, 1], "border_mode": "valid", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "nb_row": 2, "bias": true, "trainable": true, "b_regularizer": null, "nb_col": 2, "dim_ordering": "tf"}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_3", "axis": -1, "momentum": 0.99}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "convolution2d_4", "subsample": [1, 1], "border_mode": "valid", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "nb_row": 2, "bias": true, "trainable": true, "b_regularizer": null, "nb_col": 2, "dim_ordering": "tf"}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_4", "axis": -1, "momentum": 0.99}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "bias": true, "trainable": true, "b_regularizer": null, "output_dim": 256, "input_dim": 9408, "activation": "linear"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.4}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_5", "axis": -1, "momentum": 0.99}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "bias": true, "trainable": true, "b_regularizer": null, "output_dim": 128, "input_dim": 256, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_6", "axis": -1, "momentum": 0.99}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "bias": true, "trainable": true, "b_regularizer": null, "output_dim": 64, "input_dim": 128, "activation": "linear"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.4}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_7", "axis": -1, "momentum": 0.99}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "name": "dense_4", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "bias": true, "trainable": true, "b_regularizer": null, "output_dim": 32, "input_dim": 64, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_8", "axis": -1, "momentum": 0.99}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "name": "dense_5", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "bias": true, "trainable": true, "b_regularizer": null, "output_dim": 1, "input_dim": 32, "activation": "linear"}}], "keras_version": "1.2.0", "class_name": "Sequential"}